DataProcessors/ПриемкаКоллективная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>ПриемкаКоллективная</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯчейкаПриемкиГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСкладскогоДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументГУИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеДокумента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоставкаОтВнешнегоПоставщика</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСостояниеКодаВЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроверятьСоответствиеКодаТоваруПоGTIN</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазрешитьПриниматьКМБезПроверкиСостояния</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СверятьКодыСОжидаемымиПриПриемке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасширеннаяПроверкаВалидностиКодовМаркировкиЧЗ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

DataProcessors/ПриемкаКоллективная/Forms/ФормаВыбораЯчейки_OLD1/Ext/Form/Module.bsl
&НаКлиенте
Перем Компонента;


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПараметрыРаботы = ОбщегоНазначения.ПолучитьПараметрыРаботыСДокументомПТУ();
	ЗаполнитьЗначенияСвойств(Объект, ПараметрыРаботы);
	
	Элементы.НомерДокумента.Заголовок = "Номер документа: "	 + Строка(Объект.НомерСкладскогоДокумента);
	
	Компонента = ОбщегоНазначенияКлиент.ПодключитьКомпоненту();
	
	Если Компонента <> Неопределено И Не Компонента.Подключить() Тогда
		ТекстОшибки = "";
		КодОшибки = Компонента.ПолучитьОшибку(ТекстОшибки);
		ПоказатьПредупреждение(,"Ошибка: "+КодОшибки+", " + ТекстОшибки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриемкиОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	ЗапроситьЯчейкуСсервера(Текст);
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьЯчейку(Команда)
	
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаПриемки);	
	
КонецПроцедуры
 
&НаКлиенте
Процедура ЗапроситьЯчейкуСсервера(Текст)
	
	ОбщегоНазначенияКлиент.ПроигратьЗвуковойФайлЯчейки();
	
	Результат = ОбщегоНазначения.ПолучитьЯчейку(Текст);                     
	Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
		ТекстОшибки = "Ячейка " + Текст + " некорректна !!!" + Символы.ПС;
		ТекстОшибки = ТекстОшибки + Результат.Ошибка;
		ПоказатьПредупреждение(,"Ошибка: " + ТекстОшибки, 3);	
		Объект.ЯчейкаПриемки = "";
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Результат.Данные) Тогда
		
		Объект.ЯчейкаПриемкиГУИД = Результат.Данные;
		Объект.ЯчейкаПриемки = Текст;				
		
		ПараметрыРаботы = ОбщегоНазначенияКлиент.СформироватьПараметрыДляФормы("ПриемкаКоллективная", Объект);
		ОбщегоНазначения.ЗаписатьПараметрыРаботы( "ПараметрыРаботыСДокументомПТУ", ПараметрыРаботы );			
		
		Закрыть();
		ОткрытьФорму("Обработка.ПриемкаКоллективная.Форма.ФормаВыбораНоменклатуры");
					
	КонецЕсли; 
		
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если Событие = "UniversalBroadcastEvent" Тогда
		
		Результат = ОбщегоНазначения.ПолучитьЗначениеШтрихкода(Данные);
		Если ЗначениеЗаполнено(Результат.Ошибка) Тогда
			ПоказатьПредупреждение(, "Ошибка сканирования штрихкода", 4);
			Возврат;			
		КонецЕсли; 
		
		// Пользователь может нажать несколько раз сканирование штрихкода, но форма уже закрыта.
		Если ВводДоступен() Тогда
			ЗапроситьЯчейкуСсервера(Результат.Штрихкод);	
		КонецЕсли; 
				
	ИначеЕсли Событие = "ClipboardEvent" Тогда                 
		ЗапроситьЯчейкуСсервера(Данные);
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	Если Компонента <> Неопределено Тогда
		Компонента.Отключить();
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ЯчейкаПриемкиПриИзменении(Элемент)
	ЗапроситьЯчейкуСсервера(Объект.ЯчейкаПриемки);	
КонецПроцедуры


&НаКлиенте
Процедура Завершить(Команда)
	
	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("СоздатьДокументРазмещения", ЭтотОбъект, Параметры);
	ТекстВопроса = "Создать документ размещения " + Символы.ПС;
	ТекстВопроса = ТекстВопроса + " товаров по местам хранения ?";
	ПоказатьВопрос(Оповещение, ТекстВопроса, Режим); 
		
КонецПроцедуры


&НаКлиенте
Процедура СоздатьДокументРазмещения(Результат, Параметры) Экспорт
		
    Если Результат = КодВозвратаДиалога.Нет Тогда
        Возврат;
	КонецЕсли;	
	
	РезультатСтруктура = ОбщегоНазначения.СоздатьДокуметРазмещенияПоЯчейкам(Объект.ДокументГУИД);
	Если ЗначениеЗаполнено(РезультатСтруктура.Ошибка) Тогда
		ПоказатьПредупреждение(,"Ошибка: " + РезультатСтруктура.Ошибка, 4);	
		Возврат;
	КонецЕсли; 
	
	ТекстСообщения = "Создан документ размещения по ячейкам № %1 %2. Документ проведен";
	
	ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, 
			РезультатСтруктура.Данные.НомерДокумента,
			РезультатСтруктура.Данные.ДатаДокумента 
			);						
			
	Оповещение = Новый ОписаниеОповещения("ЗакрытьФормуПослеСообщения", ЭтотОбъект, Параметры);
	ПоказатьПредупреждение(Оповещение, ТекстСообщения, 4);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФормуПослеСообщения(Результат) Экспорт 
	Закрыть();
КонецПроцедуры
